IDEA Open Model
PrestressSteelType Enumeration
Compatible with IDEA StatiCa 20.1
 Type of prestress steel
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum PrestressSteelType
Public Enumeration PrestressSteelType
Members
Member name | Value | Description
PlainRoundWire | 0 |  Plain round wire - hladké dráty
IndentedWire | 1 |  Indneted wire - draty s vtisky
Strand | 2 |  Strand - lana
PlainRoundBar | 3 |  Plain round bar - hladké tyče
RibbedBar | 4 |  Ribbed bar - žebírkové tyče
CompactedStrand | 5 |  Compacted strand - lana
See Also
Reference
IdeaRS.OpenModel.Material Namespace